[Icons.Icon_Z3_GreatEscape_PlaceBeacon InteractionIconDefinition]
Text="special light"

[InteractiveObjects.MO_GreatEscape_Beacon InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_CraterLakesBeacon MissionItemDefinition]
UseFailureCharacterMessage="This should be it %s use it."
ItemName="The Hyperion Beacon has been stolen"
PickupMessage="close to you %s"
UseFailureLevelMessage="This item requires at least %d to use.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="Summary"

[ItemDefs.ID_CraterLakesBeacon:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Bandit saw tool."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_Jamesthefish MissionItemDefinition]
UseFailureCharacterMessage="Of course you are %s Use this article."
ItemName="Frederik fish"
PickupMessage="he said %s"
UseFailureLevelMessage="You must be at least %d level to use this item."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="usually"

[ItemDefs.ID_Jamesthefish:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Federico and Ulysse Pesce are good friends and should stay together.!"
NoConstraintText=""
Suffix=""
Prefix=""

